box_case/test_model_fluid_simulation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top_fluid_surface
    {
        type            patch;
        nFaces          64;
        startFace       816;
    }
    bottom_fluid_surface
    {
        type            wall;
        inGroups     1(wall);
        nFaces          64;
        startFace       880;
    }
    lateral_surface_1
    {
        type            wall;
        inGroups     1(wall);
        nFaces          40;
        startFace       944;
    }
    lateral_surface_2
    {
        type            wall;
        inGroups     1(wall);
        nFaces          40;
        startFace       984;
    }
    lateral_surface_3
    {
        type            wall;
        inGroups     1(wall);
        nFaces          40;
        startFace       1024;
    }
    lateral_surface_4
    {
        type            wall;
        inGroups     1(wall);
        nFaces          40;
        startFace       1064;
    }
)

// ************************************************************************* //
