box_case/test_model_fluid_simulation/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0 ;

boundaryField
{
    top_fluid_surface
    {
        type            totalPressure;
        p0              uniform 0;
    }


    bottom_fluid_surface
    {
        type            fixedFluxPressure;
        value           uniform 0;

    }

    lateral_surface_4
    {
        type            fixedFluxPressure;
        value           uniform 0;

    }

    lateral_surface_3
    {
        type            fixedFluxPressure;
        value           uniform 0;

    }

    lateral_surface_2
    {
        type            fixedFluxPressure;
        value           uniform 0;

    }

    lateral_surface_1
    {
        type            fixedFluxPressure;
        value           uniform 0;

    }
}